{
    "enabledLanguages": {
        "english": false,
        "chinese": false,
        "french": true,
        "arabic": true
    },
    "terms": [
        {
            "id": 1,
            "visible": true,
            "english": "Payment must be made in full before vehicle delivery.",
            "chinese": "车辆交付前必须全额付款。",
            "french": "Le paiement doit être effectué intégralement avant la livraison du véhicule.",
            "arabic": "يجب دفع المبلغ الكامل قبل تسليم المركبة."
        },
        {
            "id": 2,
            "visible": false,
            "english": "Delivery will be made within the agreed timeframe after receipt of full payment.",
            "chinese": "收到全额付款后，将在约定的时间范围内交付。",
            "french": "La livraison sera effectuée dans le délai convenu après réception du paiement intégral.",
            "arabic": "سيتم التسليم في الإطار الزمني المتفق عليه بعد استلام الدفع الكامل."
        },
        {
            "id": 3,
            "visible": true,
            "english": "All vehicle documentation will be provided as per export requirements.",
            "chinese": "将按照出口要求提供所有车辆文件。",
            "french": "Toute la documentation du véhicule sera fournie conformément aux exigences d'exportation.",
            "arabic": "سيتم توفير جميع وثائق المركبة وفقًا لمتطلبات التصدير."
        },
        {
            "id": 4,
            "visible": true,
            "english": "In case of any customs issues related to modified export license usage, while we will assist in resolving the matter with customs authorities, we bear no legal responsibility for such complications.",
            "chinese": "如因改装出口许可证使用而产生任何海关问题，虽然我们会协助处理海关事务，但我们不承担任何法律责任。",
            "french": "En cas de problèmes douaniers liés à l'utilisation d'une licence d'exportation modifiée, bien que nous assisterons à la résolution du problème avec les autorités douanières, nous ne supportons aucune responsabilité légale pour de telles complications.",
            "arabic": "في حالة أي مشاكل جمركية تتعلق باستخدام رخصة التصدير المعدلة، بينما سنساعد في حل الأمر مع السلطات الجمركية، فإننا لا نتحمل أي مسؤولية قانونية عن مثل هذه التعقيدات."
        },
        {
            "id": 5,
            "visible": true,
            "english": "The buyer acknowledges having inspected the vehicle and accepts its condition at the time of purchase.",
            "chinese": "买方确认已检查车辆并接受其购买时的状况。",
            "french": "L'acheteur reconnaît avoir inspecté le véhicule et accepte son état au moment de l'achat.",
            "arabic": "يعترف المشتري بأنه فحص المركبة ويقبل حالتها في وقت الشراء."
        },
        {
            "id": 6,
            "visible": true,
            "english": "Any disputes arising from this contract shall be resolved through mutual negotiation or applicable legal channels.",
            "chinese": "本合同引起的任何争议应通过双方协商或适用的法律途径解决。",
            "french": "Tout litige découlant de ce contrat sera résolu par négociation mutuelle ou par les voies légales applicables.",
            "arabic": "يجب حل أي نزاعات تنشأ عن هذا العقد من خلال التفاوض المتبادل أو القنوات القانونية المعمول بها."
        },
        {
            "id": 7,
            "visible": true,
            "english": "If freight costs increase by more than USD 200 on the loading day, the client is responsible for paying the difference.",
            "chinese": "如果装运当天的运费增加超过200美元，客户需要支付差额。",
            "french": "Si les coûts de fret augmentent de plus de 200 USD le jour du chargement, le client est responsable du paiement de la différence.",
            "arabic": "إذا زادت تكاليف الشحن بأكثر من 200 دولار أمريكي في يوم التحميل، يكون العميل مسؤولاً عن دفع الفرق."
        },
        {
            "id": 8,
            "visible": true,
            "english": "The client is responsible for any additional costs resulting from new Chinese taxes or policy changes implemented after the contract date.",
            "chinese": "合同日期之后实施的任何新的中国税收或政策变化所产生的额外费用由客户承担。",
            "french": "Le client est responsable de tout coût supplémentaire résultant de nouvelles taxes chinoises ou de changements de politique mis en œuvre après la date du contrat.",
            "arabic": "العميل مسؤول عن أي تكاليف إضافية ناتجة عن ضرائب صينية جديدة أو تغييرات في السياسة تم تنفيذها بعد تاريخ العقد."
        },
        {
            "id": 9,
            "visible": true,
            "english": "The agreed price is valid as of the agreement date. Any price changes due to shipping companies or Chinese government regulations on the loading day will be the client's responsibility.",
            "chinese": "约定价格自协议日期起有效。装运当天因航运公司或中国政府法规造成的任何价格变化由客户承担。",
            "french": "Le prix convenu est valable à compter de la date d'accord. Tout changement de prix dû aux compagnies maritimes ou aux réglementations du gouvernement chinois le jour du chargement sera à la charge du client.",
            "arabic": "السعر المتفق عليه ساري من تاريخ الاتفاق. أي تغييرات في الأسعار بسبب شركات الشحن أو لوائح الحكومة الصينية في يوم التحميل ستكون مسؤولية العميل."
        },
        {
            "id": 10,
            "visible": true,
            "english": "The parties hereto expressly acknowledge and agree that shipping and delivery timelines, schedules, and estimated arrival dates are provided for informational purposes only and are subject to modification, delay, or cancellation due to circumstances beyond the seller's reasonable control. Such circumstances include, without limitation, customs clearance delays, adverse weather conditions, port congestion, shipping line schedule modifications, force majeure events, governmental actions, labor disputes, equipment failures, or other unforeseeable events. The seller shall not be liable for any direct, indirect, incidental, consequential, or punitive damages arising from such delays, and the buyer hereby expressly waives, releases, and discharges any and all claims, demands, actions, causes of action, damages, costs, expenses, or compensation of any nature whatsoever arising therefrom.",
            "chinese": "本协议双方明确确认并同意，运输和交付时间、日程安排及预计到达日期仅供参考，可能因超出卖方合理控制范围的情况而修改、延迟或取消。此类情况包括但不限于海关清关延迟、恶劣天气条件、港口拥堵、航运公司时刻表变更、不可抗力事件、政府行为、劳资纠纷、设备故障或其他不可预见事件。卖方对此类延迟造成的任何直接、间接、偶然、后果性或惩罚性损害不承担责任，买方特此明确放弃、免除和解除由此产生的任何性质的所有索赔、要求、诉讼、诉因、损害、费用、开支或补偿。",
            "french": "Les parties aux présentes reconnaissent expressément et conviennent que les délais d'expédition et de livraison, les calendriers et les dates d'arrivée estimées sont fournis à titre informatif uniquement et sont sujets à modification, retard ou annulation en raison de circonstances échappant au contrôle raisonnable du vendeur. Ces circonstances incluent, sans limitation, les retards de dédouanement, les conditions météorologiques défavorables, la congestion portuaire, les modifications des horaires des compagnies maritimes, les événements de force majeure, les actions gouvernementales, les conflits du travail, les pannes d'équipement ou autres événements imprévisibles. Le vendeur ne sera pas responsable de tout dommage direct, indirect, accessoire, consécutif ou punitif résultant de tels retards, et l'acheteur renonce expressément, libère et décharge par les présentes de toute réclamation, demande, action, cause d'action, dommage, coût, dépense ou compensation de toute nature découlant de ceux-ci.",
            "arabic": "تقر الأطراف المعنية صراحة وتوافق على أن الجداول الزمنية للشحن والتسليم والجداول الزمنية وتواريخ الوصول المتوقعة مقدمة لأغراض إعلامية فقط وهي عرضة للتعديل أو التأخير أو الإلغاء بسبب ظروف خارجة عن السيطرة المعقولة للبائع. تشمل هذه الظروف على سبيل المثال لا الحصر تأخيرات التخليص الجمركي والظروف الجوية السيئة وازدحام الموانئ وتعديلات جداول خطوط الشحن وأحداث القوة القاهرة والإجراءات الحكومية والنزاعات العمالية وأعطال المعدات أو أحداث أخرى لا يمكن التنبؤ بها. لن يكون البائع مسؤولاً عن أي أضرار مباشرة أو غير مباشرة أو عرضية أو تبعية أو عقابية تنشأ عن مثل هذه التأخيرات، ويتنازل المشتري صراحة بموجب هذا ويطلق ويعفي عن أي وجميع المطالبات والمطالب والإجراءات وأسباب الدعوى والأضرار والتكاليف والنفقات أو التعويض من أي نوع ينشأ عنها."
        },
        {
            "id": 11,
            "visible": true,
            "english": "By making payment of any portion of this bill, whether in full or partial, the buyer hereby acknowledges and accepts all terms and conditions contained in this agreement, and such payment shall constitute conclusive evidence of the buyer's agreement to be bound by all provisions herein, regardless of whether a physical signature has been affixed to this document.",
            "chinese": "通过支付本账单的任何部分，无论全额或部分支付，买方特此确认并接受本协议中包含的所有条款和条件，此类支付应构成买方同意受本文件所有条款约束的决定性证据，无论是否已在本文件上签署实体签名。",
            "french": "En effectuant le paiement de toute partie de cette facture, que ce soit en totalité ou partiellement, l'acheteur reconnaît et accepte par les présentes tous les termes et conditions contenus dans le présent accord, et ce paiement constituera une preuve concluante de l'accord de l'acheteur à être lié par toutes les dispositions ci-incluses, indépendamment de savoir si une signature physique a été apposée sur ce document.",
            "arabic": "من خلال دفع أي جزء من هذه الفاتورة، سواء كان كاملاً أو جزئياً، يعترف المشتري بموجب هذا ويقبل جميع الشروط والأحكام الواردة في هذه الاتفاقية، ويشكل هذا الدفع دليلاً قاطعاً على موافقة المشتري على الالتزام بجميع الأحكام الواردة هنا، بغض النظر عما إذا كانت تم التوقيع المادي على هذه الوثيقة أم لا."
        },
        {
            "id": 12,
            "visible": true,
            "english": "The parties hereto have agreed upon and hereby acknowledge the freight charges as set forth herein, which amount to {FREIGHT}, and the exchange rate applicable to this transaction, which is established at {RATE}. It is expressly understood and agreed by both parties that in the event the actual freight charges deviate from the agreed amount by more than two hundred United States Dollars (USD 200.00), or in the event the exchange rate fluctuates by more than two (2) units from the rate specified herein, this contract shall be deemed null and void ab initio, and all pricing terms contained herein shall be subject to renegotiation and mutual agreement between the parties. No party shall be bound by the terms of this agreement under such circumstances, and any payments made prior to such deviation shall be subject to refund or adjustment as mutually agreed upon by the parties.",
            "chinese": "双方特此同意并确认本协议中规定的运费为{FREIGHT}，以及适用于本交易的汇率为{RATE}。双方明确理解并同意，如果实际运费与约定金额偏差超过二百美元（200.00美元），或汇率从本协议规定的汇率波动超过两（2）个单位，本合同应被视为自始无效，本协议中包含的所有定价条款应重新谈判并经双方共同同意。在此情况下，任何一方均不受本协议条款的约束，在此偏差之前支付的任何款项应按照双方共同商定的方式进行退款或调整。",
            "french": "Les parties aux présentes ont convenu et reconnaissent par les présentes les frais de fret tels qu'énoncés ci-inclus, qui s'élèvent à {FREIGHT}, et le taux de change applicable à cette transaction, qui est établi à {RATE}. Il est expressément entendu et convenu par les deux parties qu'en cas de déviation des frais de fret réels par rapport au montant convenu de plus de deux cents dollars américains (USD 200,00), ou en cas de fluctuation du taux de change de plus de deux (2) unités par rapport au taux spécifié ci-inclus, le présent contrat sera réputé nul et non avenu ab initio, et tous les termes de prix contenus ci-inclus seront soumis à renégociation et accord mutuel entre les parties. Aucune partie ne sera liée par les termes du présent accord dans de telles circonstances, et tout paiement effectué avant une telle déviation sera soumis à remboursement ou ajustement tel que convenu mutuellement par les parties.",
            "arabic": "اتفق الطرفان المعنيان واعترفا بموجب هذا برسوم الشحن المنصوص عليها هنا، والتي تبلغ {FREIGHT}، وسعر الصرف المعمول به في هذه المعاملة، والذي تم تحديده عند {RATE}. من المفهوم صراحة والمتفق عليه من قبل الطرفين أنه في حالة انحراف رسوم الشحن الفعلية عن المبلغ المتفق عليه بأكثر من مائتي دولار أمريكي (200.00 دولار أمريكي)، أو في حالة تقلب سعر الصرف بأكثر من وحدتين (2) عن السعر المحدد هنا، يعتبر هذا العقد باطلاً ولاغياً من البداية، وتخضع جميع شروط التسعير الواردة هنا لإعادة التفاوض والاتفاق المتبادل بين الطرفين. لن يكون أي طرف ملزماً بشروط هذه الاتفاقية في مثل هذه الظروف، وأي مدفوعات تمت قبل مثل هذا الانحراف ستخضع للاسترداد أو التعديل حسب ما يتفق عليه الطرفان بشكل متبادل."
        }
    ]
}